{
  "header": {
    "home": "Home",
    "about": "About",
    "education": "Education",
    "experience": "Experience",
    "certifications": "Certifications",
    "skills": "Skills",
    "projects": "Projects"
  },
  "home": {
    "emailTooltip": "Send Email",
    "linkedinTooltip": "LinkedIn Profile",
    "greeting": "Hey there,",
    "name": "It's Àlex Luelmo.",
    "intro": "Full-Stack Developer graduated from LaSalle with over a year of experience. Passionate about web development, back-end services, and creating innovative solutions. Looking for opportunities to apply and develop my skills."
  },
  "about": {
    "title": "About Me",
    "paragraph1": "As a Software Application Techniques graduate from LaSalle Ramon Llull University, I've built a strong foundation in full-stack development. With over a year at Nexiona Connectocrats, I've honed my skills in back-end Python services, in addition to web application development. My expertise spans developing robust back-end solutions and RESTful APIs, as well as creating intuitive user interfaces and responsive designs.",
    "paragraph2": "My career goal is to excel in web development, full-stack engineering, or database administration. I'm driven to apply my knowledge to solve technical challenges, always seeking growth opportunities. With a solid educational background and practical experience, including exposure at Fujitsu Technology Solutions, I'm committed to delivering efficient and innovative software solutions."
  },
  "education": {
    "title": "Education",
    "degrees": {
      "lasalle": {
        "degree": "Bachelor's Degree in Software Application Techniques",
        "institution": "LaSalle Ramon Llull University",
        "location": "Barcelona, Spain"
      },
      "stucom": {
        "degree": "Higher Degree in Network Computer Systems Administration",
        "institution": "Stucom Centre d'Estudis",
        "location": "Barcelona, Spain"
      },
      "thalassa": {
        "degree": "Technological Baccalaureate",
        "institution": "Institut Thalassa",
        "location": "Montgat, Spain"
      }
    }
  },
  "experience": {
    "title": "Experience",
    "experiences": {
      "nexiona": {
        "position": "Software Full-Stack Developer",
        "info": "Specialized in IoT solutions.",
        "location": "Barcelona, Spain",
        "description": "Development and maintenance of web applications. Back-end development with Python. Implementation of new features and code optimization. Collaboration in the design and development of RESTful APIs. Resolution of issues and technical support."
      },
      "fujitsu": {
        "position": "Technical, Validation of Software (Intern)",
        "info": "Japanese company in the ICT sector.",
        "location": "Barcelona, Spain",
        "description": "Verification of the different features of the developed software programs to complete their validation."
      }
    }
  },
  "certifications": {
    "title": "Certifications",
    "dateTitle": "Date of issue: ",
    "credentialButton": "View credential",
    "certificates": {
      "dataAnalysis": {
        "title": "Data Analysis with Python",
        "date": "Aug. 2024"
      },
      "google1": {
        "title": "Introduction to web development course: HTML and CSS (2/2)",
        "date": "Jul. 2024"
      },
      "google2": {
        "title": "Introduction to web development course: HTML and CSS (1/2)",
        "date": "Jun. 2024"
      },
      "pcep": {
        "title": "PCEP – Certified Entry-Level Python Programmer",
        "date": "Jun. 2024"
      },
      "b2": {
        "title": "First Certificate B2",
        "date": "Jan. 2017"
      }
    }
  },
  "skills": {
    "title": "Skills"
  },
  "projects": {
    "title": "Projects",
    "projectsData": {
      "mentecapaz": {
        "title": "MenteCapaz · React.js project",
        "type": "Final degree project",
        "description": "Development of a web portal for the management of students with mental disabilities. It uses React.js, Tailwind CSS, MySQL and Express.js. It includes functionalities such as user, center and student management, integration with Google Maps API, and authentication system. The project addresses the need to improve the educational experience of students with special needs.",
        "tags": [
          "React.js",
          "Tailwind CSS",
          "Responsive Design",
          "MySQL",
          "Express.js",
          "Google Maps API",
          "Firebase"
        ]
      },
      "cornflix": {
        "title": "CornFlix · Flutter app",
        "type": "Featured project",
        "description": "Developed a cross-platform mobile app called CornFlix using Flutter, which provides detailed information about movies. It integrates geolocation for personalized recommendations, user authentication with Firebase, and uses TheMovieDB API to get up-to-date data. It includes features like advanced search, favorites system, recommendations based on location and user preferences, viewing trailers and clips, and more.",
        "tags": ["Flutter", "Firebase", "API", "Geolocation"]
      },
      "openeventsAPI": {
        "title": "OpenEvents · API REST",
        "type": "Relevant practice",
        "description": "Building an OpenEvents-based REST API using Node.js and JavaScript. It implements event, user, attendance, messaging, and friendship management. It includes authentication, password encryption, and uses Planet Scale for MySQL cloud database. The project included development of routes, DAOs, and full documentation.",
        "tags": ["Node.js", "JavaScript", "REST API", "MySQL", "Planet Scale"]
      },
      "openeventsVue": {
        "title": "OpenEvents · Vue.js project",
        "type": "Featured project",
        "description": "Development of a website from scratch using HTML, CSS and Vue.js. The project included the implementation of responsive design, and integration with the OpenEvents API. Key functionalities: management of users, events, and relationships between them. The development involved organizing the code into views and components, handling routes, and making requests to the API.",
        "tags": ["Vue.js", "HTML", "CSS", "API", "Responsive Design"]
      },
      "ccna": {
        "title": "Case Study CCNA3",
        "type": "Relevant practice",
        "description": "Implementation of a complex network using Cisco Packet Tracer, covering CCNA3 concepts. The project included configuration of routers and switches, implementation of HSRP, NAT, static and dynamic routing, GRE tunnels, DHCP, and ACLs. Connectivity testing was performed and the entire process was documented.",
        "tags": [
          "CCNA3",
          "Networking",
          "Cisco Packet Tracer",
          "Routing",
          "Switching",
          "Security"
        ]
      },
      "portfolio": {
        "title": "Personal portfolio · React.js project",
        "type": "Featured project",
        "description": "Development of a modern and responsive personal portfolio website using React.js, TypeScript, Vite and shadcn/ui components. The site showcases my education, professional experience, skills, certifications and projects, with a clean and intuitive design.",
        "tags": [
          "React.js",
          "TypeScript",
          "Vite",
          "shadcn/ui",
          "Tailwind CSS",
          "Responsive Design"
        ]
      }
    }
  }
}
